#? 프로세스
#? at
#? chroot
#? cron
#? exit
#? kill
#? killall
#? nice
#? pgrep
#? pidof
#? pkill
#? ps
#? pstree
#? sleep
#? time
#? top
#? wait

##########################################################################
# system session 종료 | exit
##########################################################################
# 접속 종료
$ exit

##########################################################################
# ps | processor status | 현재 시스템에서 실행 중인 프로세스 시각화
##########################################################################
$ ps -ef | grep [PROCESS_NM]
$ ps -ef | grep -i httpd

$ ps aux | grep docker

UID		PS소유자						root 
PID		PS번호							28632
PPID	부모PS ID					28574
C		짧은기간 동안 CPU사용률		 0
STIME	PS 시작 시간(or 날짜)		20:26
TTY		PS 연결 터미널	 			pts/1    
TIME	총 CPU 사용 시간			0:00:00
CMD		PS실행 명령행		
		색상 부여					grep --color=auto 
		PS 명					   postgres


# Process 종료 & 정지
Ctrl+C : 프로세스 종료
Ctrl+Z : 프로세스 정지 (Stop)


##########################################################################
# 시스템 조작
##########################################################################
# uname		이름, 버전, 기타 시스템 특정 사항 등 시스템 정보 출력
# kill		자원 제한으로 인해 멈춘 프로세스 중지
# batch		미리 정의된 일정에 따라 시스템 서비스를 실행
# shutdown		시스템 종료 (모든 사용자에게 메시지 전달 가능)
# top 사용량