#! 검색	
#! find
#! grep
#! locate
#! whereis
#! which

##########################################################################
# 검색 | find
##########################################################################
# 다양한 검색 옵션 But 느림..
# --> 기본 검색 및 검색 후 바로 작업 수행 시 사용

$ find [OPTION] [PATH] [EXPRESSION]
$ find / -name ['파일명']               # 전체 경로에서 파일 탐색
$ find / -name ['디렉토리명'] -type d
$ find /home -name ['디렉토리명'] -type d


# Options
# P : 심볼릭 링크를 따라가지 않고, 심볼릭 링크 자체 정보 사용.
# L : 심볼릭 링크에 연결된 파일 정보 사용.
# H : 심볼릭 링크를 따라가지 않으나, Command Line Argument를 처리할 땐 예외.
# D : 디버그 메시지 출력.

# Expression
# name          : 파일 이름으로 검색.해당 이름에는 정규 표현식을 활용할 수 있음
# type          : 지정된 파일 타입에 해당하는 파일 검색     -d(directory) -f(file) -l(link)
# user          : 해당 유저에게 속한 파일 검색
# empty         : 빈 디렉토리 혹은 크기가 0인 파일 검색
# delete        : 검색된 파일 혹은 디렉토리 삭제
# exec          : 검색된 파일에 대해 지정된 명령 실행
# path          : 지정된 문자열 패턴에 해당하는 경로에서 검색.
# print         : 검색 결과를 출력. 검색 항목은 newline으로 구분. (기본 값)
# print0        : 검색 결과를 출력. 검색 항목은 null로 구분.
# size          : 파일 크기를 사용하여 파일 검색.
# mindepth      : 검색을 시작할 하위 디렉토리 최소 깊이 지정.
# maxdepth      : 검색할 하위 디렉토리의 최대 깊이 지정.
# atime         : n일 이내에 액세스된 파일을 찾음.
# ctime         : n일 이내에 만들어진 파일을 찾음.
# mtime         : n일 이내에 수정된 파일을 찾음.
# cnewer file   : 해당 파일보다 최근에 수정된 파일을 찾음.


##########################################################################
# 위치 검색 | locate
##########################################################################
# 빠른 검색 속도 But 한정적 검색 옵션..
# 파일 및 디렉토리를 DB에 넣어 DB 쿼리 (mlocate.db)
# db 갱신 필요
$ sudo updatedb     # NFS 환경 사용시 해당 명령어 사용 지양 --> updatedb.conf 설정 변경 후 사용
# --> 파일이 확실히 존재할 때, 위치를 찾기 위함

$ locate [OPTION] [PATTERN]
$ locate *.bak
$ locate -n 10 *.conf


##########################################################################
# 명령어 위치 검색 | which
##########################################################################
# "$ PATH 이진 파일을 효과적으로 검색"
# 명령어 실행파일 절대 경로 출력
$ which find
$ which -a find


##########################################################################
# 명령어 실행 파일 위치, 소스 위치, man 위치 | whereis
##########################################################################
$ whereis [COMMAND]



##########################################################################
# 조건 | grep
##########################################################################
$ grep [Option] [Pattern] [FILE_NM]
$ grep 'error' catalina.out
$ grep 'error' catalina.out error.txt
$ grep 'error' *.txt

# Options
# c : 일치하는 행의 수를 출력한다.
# i : 대소문자를 구별하지 않는다.
# v : 일치하지 않는 행만 출력한다.
# n : 포함된 행의 번호를 함께 출력한다.
# l : 패턴이 포함된 파일의 이름을 출력한다.
# w : 단어와 일치하는 행만 출력한다.
# x : 라인과 일치하는 행만 출력한다.
# r : 하위 디렉토리를 포함한 모든 파일에서 검색한다.
# E : 찾을 패턴을 정규 표현식으로 찾는다.
# F : 찾을 패턴을 문자열로 찾는다.
# m [n] : 최대로 표시될 수 있는 결과를 제한한다.

# grep -E ==== egrep
# grep -F ==== fgrep
