##########################################################################
# VIM - Vi IMproved | vi & vim
##########################################################################
# vi 편집 실행
$ vi [FILE_NM]

# vi 새 파일 생성
$ vi [NEW_FILE_NM]
$ vi readme.md


##########################################################################
# 명령 모드(vi Editor 진입 시 기본 모드)
##########################################################################
# 네비게이션
h  |  <
j  |  ^
k  |  v
l  |  >
0  |  라인 맨 앞
$  |  라인 맨 뒤

w  |  word         # 7w | 7단어 뒤
b  |  backward

H  |  화면 위
M  |  화면 중간
L  |  화면 끝
gg |  파일 앞
G  |  파일 끝       # 20G 20번째 Line
{  |  문단 시작
}  |  문단 끝

# 수정 & 삭제
x  |  커서 포인트 삭제
dd |  라인 삭제

# 복사 & 붙여넣기
yy |  라인 복사
p  |  붙여넣기
*p |  클립보드 내용 붙여넣기

# Object 활용법
d  |  Delete
y  |  Yank
c  |  Change

# 반복 수행
.  |  반복(Repeat)
u  |  실행 취소(Undo)
R  |  다시 실행(Redo)

# 탐색
/  |  하나씩
n  |  
?  |  

# 명령 모드 to 입력 모드
i  |  현재 커서 앞
a  |  현재 커서 뒤
o  |  현재 커서 위치 다음 줄부터 입력
s  |  현재 커서 위치 한글자 지우고 입력
I  |  현재 라인 맨 앞
A  |  현재 라인 맨 뒤
O  |  현재 커서 이전 라인에서부터 입력
S  |  현재 커서 한줄 지우고 입력

# DOCUMENT
$ vimtotor


##########################################################################
# 입력 모드(편집 모드, input 모드, insert 모드)
##########################################################################
# 입력 모드 to 명령 모드
esc


##########################################################################
# 라인 모드(ex 모드)
##########################################################################
# 저장, 종료, 탐색, 치환, vi 환경설정 등의 역할


# 명령 모드 to 라인 모드(ex 모드)
:q   |  종료
:q!  |  강제 종료 (저장X)
:w   |  저장
:w!  |  강제 저장
:wq  |  저장 + 종료 (=ZZ)
:wq! |  강제 저장 후 종료


##########################################################################
# .swp 파일
##########################################################################
# 비정상 종료 시 .swp 파일이 생성되어 백업
# 확정본으로 수정 시 삭제
