#!/bin/bash

##########################################################################################################################################
# 1. 인터넷 가능한 Linux 서버 ( 예 : WSL2 ) 에서 openjre-8 다운로드
##########################################################################################################################################

# openjre-8 다운로드 경로 : OpenJDK8U-jre_x64_linux_hotspot_8u332b09.tar.gz ( 2022-04-28 )
OPENJRE_8_DOWNLOAD_URL=https://github.com/adoptium/temurin8-binaries/releases/download/jdk8u332-b09/OpenJDK8U-jre_x64_linux_hotspot_8u332b09.tar.gz

# 다운로드시 사용할 임시 작업 디렉토리
WORK_DIR=~/tmp
[ -d "${WORK_DIR}" ] || mkdir -p "${WORK_DIR}"

# openjre-8 다운로드
curl -G -k \
  -o "${WORK_DIR}"/openjre-8.tar.gz \
  -L "${OPENJRE_8_DOWNLOAD_URL}"

##########################################################################################################################################
# 2. OpenJRE 설치할 서버에 접속 후 위에서 다운로드 받은 파일들을 서버 내 작업 디렉토리에 직접 업로드한다.
##########################################################################################################################################

# 설치파일 업로드 / offline 설치시 사용할 임시 작업 디렉토리 생성
WORK_DIR=~/tmp
[ -d "${WORK_DIR}" ] || mkdir -p "${WORK_DIR}"

# 임시 작업 디렉토리에 tar.gz 파일들을 업로드한다.

##########################################################################################################################################
# 3. 임시 작업 디렉토리에 업로드된 파일 기반으로 offline 설치
##########################################################################################################################################

# '/opt/java' 경로에 버전별로 다양한 jdk/jre 를 설치/사용할 수 있도록 구성한다.

OPEN_JRE_8_PATH=/opt/java/openjre-8
WORK_DIR=~/tmp

[ -d "${OPEN_JRE_8_PATH}" ] || sudo mkdir -p "${OPEN_JRE_8_PATH}"

sudo tar -zxf "${WORK_DIR}"/openjre-8.tar.gz \
  -C "${OPEN_JRE_8_PATH}" \
  --strip-components=1

sudo chown -R root:root "${OPEN_JRE_8_PATH}"
